{
    "Force": {
        "description": "Newton’s Laws of Motion, Frictional Force, Gravitational Force",
        "chapters": {
            "Newton’s Laws of Motion": {
                "description": "Motion, force, inertia",
                "notes": "Newton’s laws of motion, three statements describing the relations between the forces acting on a body and the motion of the body, first formulated by English physicist and mathematician Isaac Newton, which are the foundation of classical mechanics.\n\nNewton’s first law: the law of inertia\nbasketball; Newton's laws of motion\nbasketball; Newton's laws of motionWhen a basketball player shoots a jump shot, the ball always follows an arcing path. The ball follows this path because its motion obeys Isaac Newton's laws of motion.\nNewton’s first law states that if a body is at rest or moving at a constant speed in a straight line, it will remain at rest or keep moving in a straight line at constant speed unless it is acted upon by a force. In fact, in classical Newtonian mechanics, there is no important distinction between rest and uniform motion in a straight line; they may be regarded as the same state of motion seen by different observers, one moving at the same velocity as the particle and the other moving at constant velocity with respect to the particle. This postulate is known as the law of inertia.\n\nThe law of inertia was first formulated by Galileo Galilei for horizontal motion on Earth and was later generalized by René Descartes. Although the principle of inertia is the starting point and the fundamental assumption of classical mechanics, it is less than intuitively obvious to the untrained eye. In Aristotelian mechanics and in ordinary experience, objects that are not being pushed tend to come to rest. The law of inertia was deduced by Galileo from his experiments with balls rolling down inclined planes.\n\nFor Galileo, the principle of inertia was fundamental to his central scientific task: he had to explain how is it possible that if Earth is really spinning on its axis and orbiting the Sun, we do not sense that motion. The principle of inertia helps to provide the answer: since we are in motion together with Earth and our natural tendency is to retain that motion, Earth appears to us to be at rest. Thus, the principle of inertia, far from being a statement of the obvious, was once a central issue of scientific contention. By the time Newton had sorted out all the details, it was possible to accurately account for the small deviations from this picture caused by the fact that the motion of Earth’s surface is not uniform motion in a straight line (the effects of rotational motion are discussed below). In the Newtonian formulation, the common observation that bodies that are not pushed tend to come to rest is attributed to the fact that they have unbalanced forces acting on them, such as friction and air resistance.\n\nNewton’s second law: F = ma\nLearn how immovable objects and unstoppable forces are the same\nLearn how immovable objects and unstoppable forces are the sameA lesson proving immovable objects and unstoppable forces are one and the same.\nSee all videos for this article\nNewton’s second law is a quantitative description of the changes that a force can produce on the motion of a body. It states that the time rate of change of the momentum of a body is equal in both magnitude and direction to the force imposed on it. The momentum of a body is equal to the product of its mass and its velocity. Momentum, like velocity, is a vector quantity, having both magnitude and direction. A force applied to a body can change the magnitude of the momentum or its direction or both. Newton’s second law is one of the most important in all of physics. For a body whose mass m is constant, it can be written in the form F = ma, where F (force) and a (acceleration) are both vector quantities. If a body has a net force acting on it, it is accelerated in accordance with the equation. Conversely, if a body is not accelerated, there is no net force acting on it.\n\nNewton’s third law: the law of action and reaction\nNewton's third law of motion explained\nNewton's third law of motion explainedFor every action there is an equal but opposite reaction.\nSee all videos for this article\nNewton’s third law states that when two bodies interact, they apply forces to one another that are equal in magnitude and opposite in direction. The third law is also known as the law of action and reaction. This law is important in analyzing problems of static equilibrium, where all forces are balanced, but it also applies to bodies in uniform or accelerated motion. The forces it describes are real ones, not mere bookkeeping devices. For example, a book resting on a table applies a downward force equal to its weight on the table. According to the third law, the table applies an equal and opposite force to the book. This force occurs because the weight of the book causes the table to deform slightly so that it pushes back on the book like a coiled spring.\n\nIf a body has a net force acting on it, it undergoes accelerated motion in accordance with the second law. If there is no net force acting on a body, either because there are no forces at all or because all forces are precisely balanced by contrary forces, the body does not accelerate and may be said to be in equilibrium. Conversely, a body that is observed not to be accelerated may be deduced to have no net force acting on it.\n\nInfluence of Newton’s laws\nNewton’s laws first appeared in his masterpiece, Philosophiae Naturalis Principia Mathematica (1687), commonly known as the Principia. In 1543 Nicolaus Copernicus suggested that the Sun, rather than Earth, might be at the centre of the universe. In the intervening years Galileo, Johannes Kepler, and Descartes laid the foundations of a new science that would both replace the Aristotelian worldview, inherited from the ancient Greeks, and explain the workings of a heliocentric universe. In the Principia Newton created that new science. He developed his three laws in order to explain why the orbits of the planets are ellipses rather than circles, at which he succeeded, but it turned out that he explained much more. The series of events from Copernicus to Newton is known collectively as the Scientific Revolution.\n\nIn the 20th century Newton’s laws were replaced by quantum mechanics and relativity as the most fundamental laws of physics. Nevertheless, Newton’s laws continue to give an accurate account of nature, except for very small bodies such as electrons or for bodies moving close to the speed of light. Quantum mechanics and relativity reduce to Newton’s laws for larger bodies or for bodies moving more slowly."
            },
            "Frictional Force:": {
                "description": "Resistance, contact, motion",
                "notes": "Friction is the force resisting the relative motion of solid surfaces, fluid layers, and material elements sliding against each other.[2][3] Types of friction include dry, fluid, lubricated, skin, and internal -- an incomplete list. The study of the processes involved is called tribology, and has a history of more than 2000 years.[4]\n\nFriction can have dramatic consequences, as illustrated by the use of friction created by rubbing pieces of wood together to start a fire. Another important consequence of many types of friction can be wear, which may lead to performance degradation or damage to components. It is known that frictional energy losses account for about 20% of the total energy expenditure of the world.[5][6]\n\nAs briefly discussed later, there are many different contributors to the retarding force in friction, ranging from asperity deformation to the generation of charges and changes in local structure. When two bodies in contact move relative to each other, due to these various contributors some mechanical energy is transformed to heat, the free energy of structural changes and other types of dissipation. The total dissipated energy per unit distance moved is the retarding frictional force. The complexity of the interactions involved makes the calculation of friction from first principles difficult and it is often easier to use empirical methods for analysis and the development of theory.[3][2]\n\nTypes\nThere are several types of friction:\n\nDry friction is a force that opposes the relative lateral motion of two solid surfaces in contact. Dry friction is subdivided into static friction (\"stiction\") between non-moving surfaces, and kinetic friction between moving surfaces. With the exception of atomic or molecular friction, dry friction generally arises from the interaction of surface features, known as asperities (see Figure).\nFluid friction describes the friction between layers of a viscous fluid that are moving relative to each other.[7][8]\nLubricated friction is a case of fluid friction where a lubricant fluid separates two solid surfaces.[9][10][11]\nSkin friction is a component of drag, the force resisting the motion of a fluid across the surface of a body.\nInternal friction is the force resisting motion between the elements making up a solid material while it undergoes deformation.[8][4]\nHistory\nMany ancient authors including Aristotle, Vitruvius, and Pliny the Elder, were interested in the cause and mitigation of friction.[12] They were aware of differences between static and kinetic friction with Themistius stating in 350 A.D. that \"it is easier to further the motion of a moving body than to move a body at rest\".[12][13][14][15]\n\nThe classic laws of sliding friction were discovered by Leonardo da Vinci in 1493, a pioneer in tribology, but the laws documented in his notebooks were not published and remained unknown.[16][17][18][19][20][21] These laws were rediscovered by Guillaume Amontons in 1699[22] and became known as Amonton's three laws of dry friction. Amontons presented the nature of friction in terms of surface irregularities and the force required to raise the weight pressing the surfaces together. This view was further elaborated by Bernard Forest de Bélidor[23] and Leonhard Euler (1750), who derived the angle of repose of a weight on an inclined plane and first distinguished between static and kinetic friction.[24] John Theophilus Desaguliers (1734) first recognized the role of adhesion in friction.[25] Microscopic forces cause surfaces to stick together; he proposed that friction was the force necessary to tear the adhering surfaces apart.\n\nThe understanding of friction was further developed by Charles-Augustin de Coulomb (1785).[22] Coulomb investigated the influence of four main factors on friction: the nature of the materials in contact and their surface coatings; the extent of the surface area; the normal pressure (or load); and the length of time that the surfaces remained in contact (time of repose).[16] Coulomb further considered the influence of sliding velocity, temperature and humidity, in order to decide between the different explanations on the nature of friction that had been proposed. The distinction between static and dynamic friction is made in Coulomb's friction law (see below), although this distinction was already drawn by Johann Andreas von Segner in 1758.[16] The effect of the time of repose was explained by Pieter van Musschenbroek (1762) by considering the surfaces of fibrous materials, with fibers meshing together, which takes a finite time in which the friction increases.\n\nJohn Leslie (1766–1832) noted a weakness in the views of Amontons and Coulomb: If friction arises from a weight being drawn up the inclined plane of successive asperities, then why is it not balanced through descending the opposite slope? Leslie was equally skeptical about the role of adhesion proposed by Desaguliers, which should on the whole have the same tendency to accelerate as to retard the motion.[16] In Leslie's view, friction should be seen as a time-dependent process of flattening, pressing down asperities, which creates new obstacles in what were cavities before.\n\nDuration: 1 minute and 22 seconds.1:22\nHeat by friction captured by a thermal camera\nIn the long course of the development of the law of conservation of energy and of the first law of thermodynamics, friction was recognised as a mode of conversion of mechanical work into heat. In 1798, Benjamin Thompson reported on cannon boring experiments.[26]\n\nArthur Jules Morin (1833) developed the concept of sliding versus rolling friction.\n\nIn 1842, Julius Robert Mayer frictionally generated heat in paper pulp and measured the temperature rise.[27] In 1845, Joule published a paper entitled The Mechanical Equivalent of Heat, in which he specified a numerical value for the amount of mechanical work required to \"produce a unit of heat\", based on the friction of an electric current passing through a resistor, and on the friction of a paddle wheel rotating in a vat of water.[28]\n\nOsborne Reynolds (1866) derived the equation of viscous flow. This completed the classic empirical model of friction (static, kinetic, and fluid) commonly used today in engineering.[17] In 1877, Fleeming Jenkin and J. A. Ewing investigated the continuity between static and kinetic friction.[29]\n\nIn 1907, G.H. Bryan published an investigation of the foundations of thermodynamics, Thermodynamics: an Introductory Treatise dealing mainly with First Principles and their Direct Applications. He noted that for a rough body driven over a rough surface, the mechanical work done by the driver exceeds the mechanical work received by the surface. The lost work is accounted for by heat generated by friction.[30]\n\nOver the years, for example in his 1879 thesis, but particularly in 1926, Planck advocated regarding the generation of heat by rubbing as the most specific way to define heat, and the prime example of an irreversible thermodynamic process.[31]\n\nThe focus of research during the 20th century has been to understand the physical mechanisms behind friction. Frank Philip Bowden and David Tabor (1950) showed that, at a microscopic level, the actual area of contact between surfaces is a very small fraction of the apparent area.[18] This actual area of contact, caused by asperities increases with pressure. The development of the atomic force microscope (ca. 1986) enabled scientists to study friction at the atomic scale,[17] showing that, on that scale, dry friction is the product of the inter-surface shear stress and the contact area. These two discoveries explain Amonton's first law (below); the macroscopic proportionality between normal force and static frictional force between dry surfaces.\n\nLaws of dry friction\nThe elementary property of sliding (kinetic) friction were discovered by experiment in the 15th to 18th centuries and were expressed as three empirical laws:\n\nAmontons' First Law: The force of friction is directly proportional to the applied load.\nAmontons' Second Law: The force of friction is independent of the apparent area of contact.\nCoulomb's Law of Friction: Kinetic friction is independent of the sliding velocity.\nDry friction\nDry friction resists relative lateral motion of two solid surfaces in contact. The two regimes of dry friction are 'static friction' (\"stiction\") between non-moving surfaces, and kinetic friction (sometimes called sliding friction or dynamic friction) between moving surfaces.\n\nThe force of friction is always exerted in a direction that opposes movement (for kinetic friction) or potential movement (for static friction) between the two surfaces. For example, a curling stone sliding along the ice experiences a kinetic force slowing it down. For an example of potential movement, the drive wheels of an accelerating car experience a frictional force pointing forward; if they did not, the wheels would spin, and the rubber would slide backwards along the pavement. Note that it is not the direction of movement of the vehicle they oppose, it is the direction of (potential) sliding between tire and road.\n\nNormal force\n\nFree-body diagram for a block on a ramp. Arrows are vectors indicating directions and magnitudes of forces. N is the normal force, mg is the force of gravity, and Ff is the force of friction.\nMain article: Normal force\nThe normal force is defined as the net force compressing two parallel surfaces together, and its direction is perpendicular to the surfaces. In the simple case of a mass resting on a horizontal surface, the only component of the normal force is the force due to gravity, where \nN\n=\nm\ng\n{\\displaystyle N=mg\\,}. In this case, conditions of equilibrium tell us that the magnitude of the friction force is zero, \nF\nf\n=\n0\n{\\displaystyle F_{f}=0}. In fact, the friction force always satisfies \nF\nf\n≤\nμ\nN\n{\\displaystyle F_{f}\\leq \\mu N}, with equality reached only at a critical ramp angle (given by \ntan\n−\n1\n⁡\nμ\n{\\displaystyle \\tan ^{-1}\\mu }) that is steep enough to initiate sliding.\n\nThe friction coefficient is an empirical (experimentally measured) structural property that depends only on various aspects of the contacting materials, such as surface roughness. The coefficient of friction is not a function of mass or volume. For instance, a large aluminum block has the same coefficient of friction as a small aluminum block. However, the magnitude of the friction force itself depends on the normal force, and hence on the mass of the block.\n\nDepending on the situation, the calculation of the normal force \nN\n{\\displaystyle N} might include forces other than gravity. If an object is on a level surface and subjected to an external force \nP\n{\\displaystyle P} tending to cause it to slide, then the normal force between the object and the surface is just \nN\n=\nm\ng\n+\nP\ny\n{\\displaystyle N=mg+P_{y}}, where \nm\ng\n{\\displaystyle mg} is the block's weight and \nP\ny\n{\\displaystyle P_{y}} is the downward component of the external force. Prior to sliding, this friction force is \nF\nf\n=\n−\nP\nx\n{\\displaystyle F_{f}=-P_{x}}, where \nP\nx\n{\\displaystyle P_{x}} is the horizontal component of the external force. Thus, \nF\nf\n≤\nμ\nN\n{\\displaystyle F_{f}\\leq \\mu N} in general. Sliding commences only after this frictional force reaches the value \nF\nf\n=\nμ\nN\n{\\displaystyle F_{f}=\\mu N}. Until then, friction is whatever it needs to be to provide equilibrium, so it can be treated as simply a reaction.\n\nIf the object is on a tilted surface such as an inclined plane, the normal force from gravity is smaller than \nm\ng\n{\\displaystyle mg}, because less of the force of gravity is perpendicular to the face of the plane. The normal force and the frictional force are ultimately determined using vector analysis, usually via a free body diagram.\n\nIn general, process for solving any statics problem with friction is to treat contacting surfaces tentatively as immovable so that the corresponding tangential reaction force between them can be calculated. If this frictional reaction force satisfies \nF\nf\n≤\nμ\nN\n{\\displaystyle F_{f}\\leq \\mu N}, then the tentative assumption was correct, and it is the actual frictional force. Otherwise, the friction force must be set equal to \nF\nf\n=\nμ\nN\n{\\displaystyle F_{f}=\\mu N}, and then the resulting force imbalance would then determine the acceleration associated with slipping."
            },
            "Gravitational Force": {
                "description": "Attraction, mass, distance",
                "notes": "In physics, gravity (from Latin gravitas 'weight'[1]), also known as gravitation or a gravitational interaction,[2] is a fundamental interaction, a mutual attraction between all massive particles. On Earth, gravity takes a slightly different meaning: the observed force between objects and the Earth. This force is dominated by the combined gravitational interactions of particles but also includes effect of the Earth's rotation.[3] Gravity gives weight to physical objects and is essential to understanding the mechanisms responsible for surface water waves and lunar tides. Gravity also has many important biological functions, helping to guide the growth of plants through the process of gravitropism and influencing the circulation of fluids in multicellular organisms.\n\nThe gravitational attraction between primordial hydrogen and clumps of dark matter in the early universe caused the hydrogen gas to coalesce, eventually condensing and fusing to form stars. At larger scales this results in galaxies and clusters, so gravity is a primary driver for the large-scale structures in the universe. Gravity has an infinite range, although its effects become weaker as objects get farther away.\n\nGravity is accurately described by the general theory of relativity, proposed by Albert Einstein in 1915, which describes gravity in terms of the curvature of spacetime, caused by the uneven distribution of mass. The most extreme example of this curvature of spacetime is a black hole, from which nothing—not even light—can escape once past the black hole's event horizon.[4] However, for most applications, gravity is well approximated by Newton's law of universal gravitation, which describes gravity as a force causing any two bodies to be attracted toward each other, with magnitude proportional to the product of their masses and inversely proportional to the square of the distance between them.\n\nScientists are currently working to develop a theory of gravity consistent with quantum mechanics, a quantum gravity theory,[5] which would allow gravity to be united in a common mathematical framework (a theory of everything) with the other three fundamental interactions of physics.\n\nDefinitions\nGravity is the word used to describe both a fundamental physical interaction and the observed consequences of that interaction on macroscopic objects on Earth. Gravity is, by far, the weakest of the four fundamental interactions, approximately 1038 times weaker than the strong interaction, 1036 times weaker than the electromagnetic force, and 1029 times weaker than the weak interaction. As a result, it has no significant influence at the level of subatomic particles.[6] However, gravity is the most significant interaction between objects at the macroscopic scale, and it determines the motion of planets, stars, galaxies, and even light.\n\nGravity, as the gravitational attraction at the surface of a planet or other celestial body,[7] may also include the centrifugal force resulting from the planet's rotation (see § Earth's gravity).[3]\n\nHistory\nMain article: History of gravitational theory\nAncient world\nThe nature and mechanism of gravity were explored by a wide range of ancient scholars. In Greece, Aristotle believed that objects fell towards the Earth because the Earth was the center of the Universe and attracted all of the mass in the Universe towards it. He also thought that the speed of a falling object should increase with its weight, a conclusion that was later shown to be false.[8] While Aristotle's view was widely accepted throughout Ancient Greece, there were other thinkers such as Plutarch who correctly predicted that the attraction of gravity was not unique to the Earth.[9]\n\nAlthough he did not understand gravity as a force, the ancient Greek philosopher Archimedes discovered the center of gravity of a triangle.[10] He postulated that if two equal weights did not have the same center of gravity, the center of gravity of the two weights together would be in the middle of the line that joins their centers of gravity.[11] Two centuries later, the Roman engineer and architect Vitruvius contended in his De architectura that gravity is not dependent on a substance's weight but rather on its \"nature\".[12] In the 6th century CE, the Byzantine Alexandrian scholar John Philoponus proposed the theory of impetus, which modifies Aristotle's theory that \"continuation of motion depends on continued action of a force\" by incorporating a causative force that diminishes over time.[13]\n\nIn 628 CE, the Indian mathematician and astronomer Brahmagupta proposed the idea that gravity is an attractive force that draws objects to the Earth and used the term gurutvākarṣaṇ to describe it.[14]: 105 [15][16]\n\nIn the ancient Middle East, gravity was a topic of fierce debate. The Persian intellectual Al-Biruni believed that the force of gravity was not unique to the Earth, and he correctly assumed that other heavenly bodies should exert a gravitational attraction as well.[17] In contrast, Al-Khazini held the same position as Aristotle that all matter in the Universe is attracted to the center of the Earth.[18]\n\n\nThe Leaning Tower of Pisa, where according to legend Galileo performed an experiment about the speed of falling objects\nScientific revolution\nMain article: Scientific Revolution\nIn the mid-16th century, various European scientists experimentally disproved the Aristotelian notion that heavier objects fall at a faster rate.[19] In particular, the Spanish Dominican priest Domingo de Soto wrote in 1551 that bodies in free fall uniformly accelerate.[19] De Soto may have been influenced by earlier experiments conducted by other Dominican priests in Italy, including those by Benedetto Varchi, Francesco Beato, Luca Ghini, and Giovan Bellaso which contradicted Aristotle's teachings on the fall of bodies.[19]\n\nThe mid-16th century Italian physicist Giambattista Benedetti published papers claiming that, due to specific gravity, objects made of the same material but with different masses would fall at the same speed.[20] With the 1586 Delft tower experiment, the Flemish physicist Simon Stevin observed that two cannonballs of differing sizes and weights fell at the same rate when dropped from a tower.[21]\n\nIn the late 16th century, Galileo Galilei's careful measurements of balls rolling down inclines allowed him to firmly establish that gravitational acceleration is the same for all objects.[22][23]: 334  Galileo postulated that air resistance is the reason that objects with a low density and high surface area fall more slowly in an atmosphere. In his 1638 work Two New Sciences Galileo proved that that the distance traveled by a falling object is proportional to the square of the time elapsed. His method was a form of graphical numerical integration since concepts of algebra and calculus were unknown at the time.[24]: 4  This was later confirmed by Italian scientists Jesuits Grimaldi and Riccioli between 1640 and 1650. They also calculated the magnitude of the Earth's gravity by measuring the oscillations of a pendulum.[25]\n\nGalileo also broke with incorrect ideas of Aristotelian philosophy by regarding inertia as persistence of motion, not a tendency to come to rest. By considering that the laws of physics appear identical on a moving ship to those land, Galileo developed the concepts of reference frame and the principle of relativity.[26]: 5  These concepts would become central to Newton's mechanics, only to be transformed in Einstein's theory of gravity, the general theory of relativity.[27]: 17 \n\nJohannes Kepler, in his 1609 book Astronomia nova described gravity as a mutual attraction, claiming that if the Earth and Moon were not held apart by some force they would come together. He recognized that mechanical forces cause action, creating a kind of celestial machine. On the other hand Kepler viewed the force of the Sun on the planets as magnetic and acting tangential to their orbits and he assumed with Aristotle that inertia meant objects tend to come to rest.[28][29]: 846 \n\nIn 1666, Giovanni Alfonso Borelli avoided the key problems that limited Kepler. By Borelli's time the concept of inertia had its modern meaning as the tendency of objects to remain in uniform motion and he viewed the Sun as just another heavenly body. Borelli developed the idea of mechanical equilibrium, a balance between inertia and gravity. Newton cited Borelli's influence on his theory.[29]: 848 \n\nIn 1657, Robert Hooke published his Micrographia, in which he hypothesized that the Moon must have its own gravity.[30]: 57  In a communication to the Royal Society in 1666 and his 1674 Gresham lecture, An Attempt to prove the Annual Motion of the Earth, Hooke took the important step of combining related hypothesis and then forming predictions based on the hypothesis.[31] He wrote:\n\nI will explain a system of the world very different from any yet received. It is founded on the following positions. 1. That all the heavenly bodies have not only a gravitation of their parts to their own proper centre, but that they also mutually attract each other within their spheres of action. 2. That all bodies having a simple motion, will continue to move in a straight line, unless continually deflected from it by some extraneous force, causing them to describe a circle, an ellipse, or some other curve. 3. That this attraction is so much the greater as the bodies are nearer. As to the proportion in which those forces diminish by an increase of distance, I own I have not discovered it....[32][33]\n\nHooke was an important communicator who helped reformulate the scientific enterprise.[34] He was one of the first professional scientists and worked as the then-new Royal Society's curator of experiments for 40 years.[35] However his valuable insights remained hypotheses since he was unable to convert them in to a mathematical theory of gravity and workout the consequences.[29]: 853  For this he turned to Newton, writing him a letter in 1679, outlining a model of planetary motion in a void or vacuum due to attractive action at a distance. This letter likely turned Newton's thinking in a new direction leading to his revolutionary work on gravity.[34] When Newton reported his results in 1686, Hooke claimed the inverse square law portion was his \"notion\".\n\nNewton's theory of gravitation\nMain article: Newton's law of universal gravitation\n\nEnglish physicist and mathematician, Sir Isaac Newton (1642–1727)\nBefore 1684 scientists including Christopher Wren, Robert Hooke and Edmund Halley determined that Kepler's third law, relating to planetary orbital periods, would prove the inverse square law if the orbits where circles. However the orbits were known to be ellipses. At Halley's suggestion, Newton tackled the problem and was able to prove that ellipses also proved the inverse square relation from Kepler's observations.[27]: 13  In 1684, Isaac Newton sent a manuscript to Edmond Halley titled De motu corporum in gyrum ('On the motion of bodies in an orbit'), which provided a physical justification for Kepler's laws of planetary motion.[36] Halley was impressed by the manuscript and urged Newton to expand on it, and a few years later Newton published a groundbreaking book called Philosophiæ Naturalis Principia Mathematica (Mathematical Principles of Natural Philosophy).\n\nIn his book, Newton described gravitation as a universal force, and claimed that it operated on objects \"according to the quantity of solid matter which they contain and propagates on all sides to immense distances always at the inverse square of the distances\"[37]: 546  This formulation had two important parts. First was equating inertial mass and gravitational mass. Newton's 2nd law defines force via \nF\n=\nm\na\n{\\displaystyle F=ma} for inertial mass, his law of gravitational force uses the same mass. Newton did experiments with pendulums to verify this concept as best he could.[27]: 11 \n\nThe second aspect of Newton's formulation was the inverse square of distance. This aspect was not new: the astronomer Ismaël Bullialdus proposed it around 1640. Seeking proof, Newton made quantitative analysis around 1665, considering the period and distance of the Moon's orbit and considering the timing of objects falling on Earth. Newton did not publish these results at the time because he could not prove that the Earth's gravity acts as if all its mass were concentrated at its center. That proof took him twenty years.[27]: 13 \n\nNewton's Principia was well received by the scientific community, and his law of gravitation quickly spread across the European world.[38] More than a century later, in 1821, his theory of gravitation rose to even greater prominence when it was used to predict the existence of Neptune. In that year, the French astronomer Alexis Bouvard used this theory to create a table modeling the orbit of Uranus, which was shown to differ significantly from the planet's actual trajectory. In order to explain this discrepancy, many astronomers speculated that there might be a large object beyond the orbit of Uranus which was disrupting its orbit. In 1846, the astronomers John Couch Adams and Urbain Le Verrier independently used Newton's law to predict Neptune's location in the night sky, and the planet was discovered there within a day.[39][40]\n\nNewton's formulation was later condensed into the inverse-square law:\n\nF\n=\nG\nm\n1\nm\n2\nr\n2\n,\n{\\displaystyle F=G{\\frac {m_{1}m_{2}}{r^{2}}},}where F is the force, m1 and m2 are the masses of the objects interacting, r is the distance between the centers of the masses and G is the gravitational constant 6.674×10−11 m3⋅kg−1⋅s−2.[41] While G is also called Newton's constant, Newton did not use this constant or formula, he only discussed proportionality. But this allowed him to come to an astounding conclusion we take for granted today: the gravity of the Earth on the Moon is the same as the gravity of the Earth on an apple:\nM\nearth\n∝\na\napple\nR\nradius of earth\n2\n=\na\nmoon\nR\nlunar orbit\n2\n{\\displaystyle M_{\\text{earth}}\\propto a_{\\text{apple}}R_{\\text{radius of earth}}^{2}=a_{\\text{moon}}R_{\\text{lunar orbit}}^{2}}Using the values known at the time, Newton was able to verify this form of his law. The value of G was eventually measured by Henry Cavendish in 1797.[42]: 31 \n\nEinstein's general relativity\nMain article: History of general relativity\nGeneral relativity\nSpacetime curvature schematic\nG\nμ\nν\n+\nΛ\ng\nμ\nν\n=\nκ\nT\nμ\nν\n{\\displaystyle G_{\\mu \\nu }+\\Lambda g_{\\mu \\nu }={\\kappa }T_{\\mu \\nu }}\nIntroduction\nHistoryTimelineTests\nMathematical formulation\nFundamental concepts\nPhenomena\nEquationsFormalisms\nSolutions\nScientists\nicon Physics portal Category\nvte\nEventually, astronomers noticed an eccentricity in the orbit of the planet Mercury which could not be explained by Newton's theory: the perihelion of the orbit was increasing by about 42.98 arcseconds per century. The most obvious explanation for this discrepancy was an as-yet-undiscovered celestial body, such as a planet orbiting the Sun even closer than Mercury, but all efforts to find such a body turned out to be fruitless. In 1915, Albert Einstein developed a theory of general relativity which was able to accurately model Mercury's orbit.[43]\n\nEinstein's theory brought two other ideas with independent histories into the physical theories of gravity: the principle of relativity and non-Euclidean geometry\n\nThe principle of relativity, introduced by Galileo and used as a foundational principle by Newton, lead to a long and fruitless search for a luminiferous aether after Maxwell's equations demonstrated that light propagated at a fixed speed independent of reference frame. In Newton's mechanics, velocities add: a cannon ball shot from a moving ship would travel with a trajectory which included the motion of the ship. Since light speed was fixed, it was assumed to travel in a fixed, absolute medium. Many experiments sought to reveal this medium but failed and in 1905 Einstein's special relativity theory showed the aether was not needed. Special relativity proposed that mechanics be reformulated to use the Lorentz transformation already applicable to light rather than the Galilean transformation adopted by Newton. Special relativity, as in special case, specifically did not cover gravity.[27]: 4 \n\nWhile relativity was associated with mechanics and thus gravity, the idea of altering geometry only joined the story of gravity once mechanics required the Lorentz transformations. Geometry was an ancient science that gradually broke free of Euclidean limitations when Carl Gauss discovered in the 1800s that surfaces in any number of dimensions could be characterized by a metric, a distance measurement along the shortest path between two points that reduces to Euclidean distance at infinitesimal separation. Gauss' student Bernhard Riemann developed this into a complete geometry by 1854. These geometries are locally flat but have global curvature.[27]: 4 \n\nIn 1907, Einstein took his first step by using special relativity to create a new form of the equivalence principle. The equivalence of inertial mass and gravitational mass was a known empirical law. The m in Newton's first law, \nF\n=\nm\na\n{\\displaystyle F=ma}, has the same value as the m in Newton's law of gravity on Earth, \nF\n=\nG\nM\nm\n/\nr\n2\n{\\displaystyle F=GMm/r^{2}}. In what he later described as \"the happiest thought of my life\" Einstein realized this meant that in free-fall, an accelerated coordinate system exists with no local gravitational field.[44] Every description of gravity in any other coordinate system must transform to give no field in the free-fall case, a powerful invariance constraint on all theories of gravity.[27]: 20 \n\nEinstein's description of gravity was accepted by the majority of physicists for two reasons. First, by 1910 his special relativity was accepted in Germany physics and was spreading to other countries. Second, his theory explained experimental results like the perihelion of Mercury and the bending of light around the Sun better than Newton's theory.[45] In the coming years, a wide range of experiments provided additional support for the idea of general relativity.[46]: p.1–9 [47][48][49][50] Today, Einstein's theory of relativity is used for all gravitational calculations where absolute precision is desired, although Newton's inverse-square law is accurate enough for virtually all ordinary calculations.[46]: 79 [51]\n\nOn Earth\n\nAn initially-stationary object that is allowed to fall freely under gravity drops a distance that is proportional to the square of the elapsed time. This image spans half a second and was captured at 20 flashes per second.\nMain article: Gravity of Earth\nEvery planetary body (including the Earth) is surrounded by its own gravitational field, which can be conceptualized with Newtonian physics as exerting an attractive force on all objects. Assuming a spherically symmetrical planet, the strength of this field at any given point above the surface is proportional to the planetary body's mass and inversely proportional to the square of the distance from the center of the body.\n\n\nIf an object with comparable mass to that of the Earth were to fall towards it, then the corresponding acceleration of the Earth would be observable.\nThe strength of the gravitational field is numerically equal to the acceleration of objects under its influence.[52] The rate of acceleration of falling objects near the Earth's surface varies very slightly depending on latitude, surface features such as mountains and ridges, and perhaps unusually high or low sub-surface densities.[53] For purposes of weights and measures, a standard gravity value is defined by the International Bureau of Weights and Measures, under the International System of Units (SI).\n\nThe force of gravity experienced by objects on Earth's surface is the vector sum of two forces:[3] (a) The gravitational attraction in accordance with Newton's universal law of gravitation, and (b) the centrifugal force, which results from the choice of an earthbound, rotating frame of reference. The force of gravity is weakest at the equator because of the centrifugal force caused by the Earth's rotation and because points on the equator are farthest from the center of the Earth. The force of gravity varies with latitude, and the resultant acceleration increases from about 9.780 m/s2 at the Equator to about 9.832 m/s2 at the poles.[54][55]"
            }
        }
    },
    "Work, Energy, and Power": {
        "description": "Work Done by a Force, Kinetic and Potential Energy, Law of Conservation of Energy",
        "chapters": {}
    },
    "Gravitation": {
        "description": "Universal Law of Gravitation, Acceleration due to Gravity (g), Mass vs. Weight",
        "chapters": {}
    }
}